In [1]:
# Import our dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from sqlalchemy import create_engine
import psycopg2
from config import db_password

In [2]:
# read in cvs as dataframe
df = pd.read_csv("../Data/socialmedia_usage_agewise.csv")
df.head()

    usagedate  age_18_29_per  age_30_49_per  age_50_64_per  over_65_per
0  2005-03-21           0.07           0.06           0.04         0.03
1  2005-12-08           0.16           0.09           0.05         0.02
2  2006-08-31           0.41           0.06           0.03         0.00
3  2008-05-11           0.60           0.21           0.07         0.02
4  2008-08-10           0.65           0.27           0.10         0.03

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   usagedate      30 non-null     object
 1   age_18_29_per  30 non-null     float64
 2   age_30_49_per  30 non-null     float64
 3   age_50_64_per  30 non-null     float64
 4   over_65_per    30 non-null     float64
dtypes: float64(4), object(1)
memory usage: 1.3+ KB

In [4]:
# convert string to Datetime
df['usagedate'] = pd.to_datetime(df['usagedate'])

In [5]:
# extract the year
df['year'] = pd.to_datetime(df['usagedate']).dt.year
df.tail()

    usagedate  age_18_29_per  age_30_49_per  age_50_64_per  over_65_per  year
25 2015-07-12           0.90           0.77           0.51         0.35  2015
26 2016-11-06           0.86           0.80           0.64         0.34  2016
27 2018-01-10           0.88           0.78           0.64         0.37  2018
28 2019-02-07           0.90           0.82           0.69         0.40  2019
29 2021-02-08           0.84           0.81           0.73         0.45  2021

In [6]:
# drop usagedate column
df.drop(columns=['usagedate'], inplace=True)
df.head()

   age_18_29_per  age_30_49_per  age_50_64_per  over_65_per  year
0           0.07           0.06           0.04         0.03  2005
1           0.16           0.09           0.05         0.02  2005
2           0.41           0.06           0.03         0.00  2006
3           0.60           0.21           0.07         0.02  2008
4           0.65           0.27           0.10         0.03  2008

In [7]:
# groupby year to get the mean
df = df.groupby(['year'], as_index=False).mean()
df

    year  age_18_29_per  age_30_49_per  age_50_64_per  over_65_per
0   2005       0.115000       0.075000       0.045000     0.025000
1   2006       0.410000       0.060000       0.030000     0.000000
2   2008       0.638000       0.266000       0.092000     0.024000
3   2009       0.716667       0.443333       0.220000     0.063333
4   2010       0.776667       0.531667       0.326667     0.106667
5   2011       0.805000       0.600000       0.370000     0.130000
6   2012       0.845000       0.660000       0.435000     0.190000
7   2013       0.876667       0.726667       0.510000     0.240000
8   2014       0.840000       0.770000       0.520000     0.270000
9   2015       0.900000       0.770000       0.510000     0.350000
10  2016       0.860000       0.800000       0.640000     0.340000
11  2018       0.880000       0.780000       0.640000     0.370000
12  2019       0.900000       0.820000       0.690000     0.400000
13  2021       0.840000       0.810000       0.730000     0.450000

In [8]:
# create new column 25-34 years age range
df['25-34 years'] = (5/11)*df['age_18_29_per'] + (5/19)*df['age_30_49_per']
df

,year,age_18_29_per,age_30_49_per,age_50_64_per,over_65_per,25-34 years
0,2005,0.115000,0.075000,0.045000,0.025000,0.072010
1,2006,0.410000,0.060000,0.030000,0.000000,0.202153
2,2008,0.638000,0.266000,0.092000,0.024000,0.360000
3,2009,0.716667,0.443333,0.220000,0.063333,0.442424
4,2010,0.776667,0.531667,0.326667,0.106667,0.492943
5,2011,0.805000,0.600000,0.370000,0.130000,0.523804
6,2012,0.845000,0.660000,0.435000,0.190000,0.557775
7,2013,0.876667,0.726667,0.510000,0.240000,0.589713
8,2014,0.840000,0.770000,0.520000,0.270000,0.584450
9,2015,0.900000,0.770000,0.510000,0.350000,0.611722
10,2016,0.860000,0.800000,0.640000,0.340000,0.601435
11,2018,0.880000,0.780000,0.640000,0.370000,0.605263
12,2019,0.900000,0.820000,0.690000,0.400000,0.624880
13,2021,0.840000,0.810000,0.730000,0.450000,0.594976

In [9]:
# rename and reorder columns to match suicide dataset
df.rename(columns={'age_18_29_per': '15-24 years', 'age_30_49_per': '35-54 years', 'age_50_64_per': '55-74 years', 'over_65_per': '75+ years'}, inplace=True)
new_column_order = ['year', "15-24 years", "25-34 years", "35-54 years", '55-74 years', '75+ years']
df = df[new_column_order]
df

    year  15-24 years  25-34 years  35-54 years  55-74 years  75+ years
0   2005     0.115000     0.072010     0.075000     0.045000   0.025000
1   2006     0.410000     0.202153     0.060000     0.030000   0.000000
2   2008     0.638000     0.360000     0.266000     0.092000   0.024000
3   2009     0.716667     0.442424     0.443333     0.220000   0.063333
4   2010     0.776667     0.492943     0.531667     0.326667   0.106667
5   2011     0.805000     0.523804     0.600000     0.370000   0.130000
6   2012     0.845000     0.557775     0.660000     0.435000   0.190000
7   2013     0.876667     0.589713     0.726667     0.510000   0.240000
8   2014     0.840000     0.584450     0.770000     0.520000   0.270000
9   2015     0.900000     0.611722     0.770000     0.510000   0.350000
10  2016     0.860000     0.601435     0.800000     0.640000   0.340000
11  2018     0.880000     0.605263     0.780000     0.640000   0.370000
12  2019     0.900000     0.624880     0.820000     0.690000   0.400000
13  2021     0.840000     0.594976     0.810000     0.730000   0.450000

In [10]:
# change columns to row
df = df.melt(id_vars=["year"], 
        var_name="age_range", 
        value_name="usage")

In [11]:
df.head()

   year    age_range     usage
0  2005  15-24 years  0.115000
1  2006  15-24 years  0.410000
2  2008  15-24 years  0.638000
3  2009  15-24 years  0.716667
4  2010  15-24 years  0.776667

In [12]:
# get median age of age_range column and get year born
df.loc[(df['age_range'] == '15-24 years'), 'age_med'] = 20  
df.loc[(df['age_range'] == '25-34 years'), 'age_med'] = 30 
df.loc[(df['age_range'] == '35-54 years'), 'age_med'] = 45 
df.loc[(df['age_range'] == '55-74 years'), 'age_med'] = 65 
df.loc[(df['age_range'] == '75+ years'), 'age_med'] = 75 
df.head()

   year    age_range     usage  age_med
0  2005  15-24 years  0.115000     20.0
1  2006  15-24 years  0.410000     20.0
2  2008  15-24 years  0.638000     20.0
3  2009  15-24 years  0.716667     20.0
4  2010  15-24 years  0.776667     20.0

In [13]:
# calculate year born and create new column
df['year_born'] = df['year'] - df['age_med']
df.head()

   year    age_range     usage  age_med  year_born
0  2005  15-24 years  0.115000     20.0     1985.0
1  2006  15-24 years  0.410000     20.0     1986.0
2  2008  15-24 years  0.638000     20.0     1988.0
3  2009  15-24 years  0.716667     20.0     1989.0
4  2010  15-24 years  0.776667     20.0     1990.0

In [14]:
# determine generation based on year born using conditionals
df.loc[(df['year_born'] >= 1997) & (df['year_born'] <= 2012), 'generation'] = 'Generation Z'  
df.loc[(df['year_born'] >= 1981) & (df['year_born'] <= 1996), 'generation'] = 'Millenials'  
df.loc[(df['year_born'] >= 1965) & (df['year_born'] <= 1980), 'generation'] = 'Generation X'  
df.loc[(df['year_born'] >= 1946) & (df['year_born'] <= 1964), 'generation'] = 'Boomers'
df.loc[(df['year_born'] >= 1928) & (df['year_born'] <= 1945), 'generation'] = 'Silent'
df.loc[(df['year_born'] >= 1901) & (df['year_born'] <= 1927), 'generation'] = 'G.I. Generation'
df.head()

   year    age_range     usage  age_med  year_born  generation
0  2005  15-24 years  0.115000     20.0     1985.0  Millenials
1  2006  15-24 years  0.410000     20.0     1986.0  Millenials
2  2008  15-24 years  0.638000     20.0     1988.0  Millenials
3  2009  15-24 years  0.716667     20.0     1989.0  Millenials
4  2010  15-24 years  0.776667     20.0     1990.0  Millenials

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        70 non-null     int64
 1   age_range   70 non-null     object
 2   usage       70 non-null     float64
 3   age_med     70 non-null     float64
 4   year_born   70 non-null     float64
 5   generation  70 non-null     object
dtypes: float64(3), int64(1), object(2)
memory usage: 3.4+ KB

In [16]:
# Create the output file (CSV).
output_data_file = "../Data/cleaned_socialmedia_usage.csv"
# Export the usage dataframe into a CSV.
df.to_csv(output_data_file, index = False)

In [17]:
# import usage dataframe to PostgreSQL
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/social_media_impact"
engine = create_engine(db_string)
df.to_sql(name='usage', con=engine, if_exists='replace')